---
kind: property
id: P:Autodesk.Revit.DB.FabricationConnectorInfo.FabricationIndex
source: html/0de0d69d-b7d9-55da-5dbb-e7772d52dfc4.htm
---
# Autodesk.Revit.DB.FabricationConnectorInfo.FabricationIndex Property

The index of the connector shown within the fabrication software.

## Syntax (C#)
```csharp
public int FabricationIndex { get; }
```